Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler class implements Tekla.BIM.DirectManipulation.Adapters.IInteractorEvents and Tekla.BIM.DirectManipulation.Adapters.IInteractionHandler
for Tekla Structures.
Remarks:
During runtime, all functionality runs in the same thread. All calls to any public methods are invoked to the AKit thread.
Therefore no internal locks are required and none of the private methods should require an invoke.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.lastData
The last toleration data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.graphicsDrawer
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicsDrawer to visualize the handles with.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.tolerationHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler to forward numeric input events to.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.objectSelectionState
The model object selection state.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.autoSaveHandler
The auto-save handler.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.previousHitPointId
The previous hit point identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.previousOrthoStatus
The previous ortho status.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler class.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.#ctor(Tekla.BIM.DirectManipulation.Adapters.IGraphicsViewHandler,Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler,Tekla.Structures.DirectManipulation.Adapter.State.ModelObjectSelectionState)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler class.
graphicManager: The Tekla.BIM.DirectManipulation.Adapters.IGraphicsViewHandler exposing the views to draw the handles on.
tolerationHandler: The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHandler to forward numeric input events to.
objectSelectionState: The model object selection state.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.CursorHitEvent
Occurs when the cursor hits a point in the view.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.CursorRollover
Occurs when the cursor hovers a point in the view.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragEnded
Occurs when the user stops dragging a handle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragOngoing
Occurs when the user continues dragging a handle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragStarted
Occurs when the user starts dragging a handle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointSelected
Occurs when the user selected a handle.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HandleDeleteRequested
Occurs when the user invokes a delete request for all selected objects.
The return value indicates whether any handles were selected when the event occurred.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.InputsReceived
Occurs when the user presses a supported key.
The return value indicates whether any handles were under the cursor when the event occurred.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.NumericInputStarting
Occurs when the user starts to provide numeric input.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.Imports
Gets the native TS interaction imports.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnUserInputsReceived(Tekla.BIM.DirectManipulation.Adapters.UserInputsEventHandler,System.Boolean)
Called when the user inputs are received.
handler: The handler.
fromHandle: Whether to get the inputs from the DM handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.GetScreenCoordinate(Tekla.Common.Geometry.Vector3)
Gets the screen coordinate of the location in the active Zkit world.
location: The location.
Returns: The screen coordinate of the location in the active Zkit world.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.GetUserInputs(System.Boolean)
Tries to get the most recent user inputs (e.g. key press) data supported by DM.
fromHandle: Whether to gets the inputs for the selected handles.
Returns: The user inputs data, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.DrawHandle``1(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{``0})
Draws or updates the given handle to the view.
The type of geometry data attached to the visualizationData.
visualizationData: The handle to draw or update.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.RemoveHandle``1(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{``0})
Removes the given handle from the view.
The type of geometry data attached to the visualizationData.
visualizationData: The handle to remove.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.DrawCursor``1(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{``0},System.Boolean)
Draws or updates the cursor for the given handle.
The type of geometry data attached to the visualizationData.
visualizationData: The handle to draw or update.
setCursor: Indicates to set or unset the cursor.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.ValidateHandleSelection(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs,Tekla.BIM.DirectManipulation.Services.Interaction.IHandle)
Validates if the handle selection is valid.
tolerationData: The Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs instance containing the event data.
handle: The target handle.
Returns: true if the handle selection is allowed; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.GetHandleTolerationEventArgs(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitPointEventArgs@)
Tries to get the most recent cursor event data from Tekla Structures core.
eventArgs: The resulting event arguments, or null if getting failed.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.RaiseEvent(Tekla.BIM.DirectManipulation.Adapters.HitPointEventHandler)
Raises the given event handler.
eventHandler: The event handler to raise with, as a parameter,
the toleration event data read from Tekla Structures.
Returns: The toleration hit point event arguments.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.SendSelectionChangedMessage(System.Collections.Generic.IEnumerable{System.Object})
Sends the selection changed message.
selectedObjects: The selected objects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.GetCursorEventArgs(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@)
Tries to get the most recent cursor event data from Tekla Structures core.
eventArgs: The resulting event arguments, or null if getting failed.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.GetCursorEventArgs(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@,System.Int32@)
Tries to get the most recent cursor event data from Tekla Structures core.
eventArgs: The resulting event arguments, or null if getting failed.
handleIdentifier: The identifier of the associated handle; or zero, if no handle is associated.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.RaiseCursorEvent(Tekla.BIM.DirectManipulation.Adapters.TolerationEventHandler)
Raises the given event handler.
eventHandler: The event handler to raise with, as a parameter,
the cursor event data read from Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.UpdateObjectSelection(System.Collections.Generic.ICollection{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject})
Updates the object selection states in TS Core.
newObjects: The new objects selection.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HandleAutoSave
Handles the auto-save state based on the handle manipulation.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.UpdateCoreToleration(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitPointEventArgs,System.Boolean)
Updates the core toleration, including numeric snap values and reference points if applicable.
eventArgs: The Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitPointEventArgs instance containing the event data.
updateReferencePoint: A value indicating whether update reference point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnPopUpMenuRequested(System.String)
Occurs when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry receives an event with Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.PopupMenuRequested as the parameter.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.PopupMenuRequested.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleHitTest(System.String)
Occurs when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry receives an event with Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleHitTest as parameter,
and raises Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.CursorHitEvent if the required data can be fetched.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleHitTest.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleRollover(System.String)
Occurs when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry receives an event with Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleRolloverTest as parameter,
and raises Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.CursorRollover if the required data can be fetched.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleRolloverTest.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleDragEnded(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragEnded event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragEnded.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleDragOngoing(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragOngoing event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragOngoing.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleDragStarted(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointDragStarted event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragStarted.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleSelected(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HitPointSelected event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleSelect.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnHandleDeleteRequested(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.HandleDeleteRequested event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.DeleteSelectedObjects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnNumericInputRequested(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.NumericInputStarting event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputRequested.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionHandler.OnUserInputsReceived(System.String)
Occurs when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry receives an event with Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived as the parameter.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived.